Week7/W7D3/personal_goals_app/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ZKMFVBwfgbcdPIWZ3SVv8A"], ["updated_at", "2021-06-23 23:09:48.142279"], ["id", 15]]